tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
cask_args appdir: "/Applications"
tap "homebrew/cask-fonts"

# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
# brew "certbot"
# This library is for the GeoIP Legacy format (dat)
# brew "geoip"
# Log analyzer and interactive viewer for the Apache Webserver
# brew "goaccess"
# Access DVDs as block devices without the decryption
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum"
# Platform built on V8 to build network applications NEED TO REVISIT
# brew "node", link: false
# Create screenshots of webpages from the terminal
brew "webkit2png"
# Internet file retriever
brew "wget"

mas "Xcode", id: 497799835

mas "Monosnap", id: 540348655

mas "PDF Expert", id: 1055273043

# Only for certain folks
mas "xScope", id: 889428659
mas "OmniPlan", id: 1040002810

# mas "DarkestDungeon", id: 1102975274
# mas "OmniGraffle", id: 711830901

# Matt Stuff
mas "PCalc", id: 403504866
mas "Reeder", id: 880001334
mas "Sip", id: 507257563
mas "SiteSucker", id: 442168834

# Look for the install for Soulver 3
mas "Soulver", id: 413965349
mas "Thumbtack", id: 500948998

cask "alfred"
cask "acorn"
cask "appcleaner"
cask "betterzip"
cask "backblaze"
cask "clockify"
cask "firefox"
cask "fork"
cask "forklift"
cask "google-chrome"
cask "imageoptim"
cask "kaleidoscope"
cask "pastebot"
cask "scrutiny"
cask "slack"
cask "visual-studio-code"
cask "microsoft-office"
cask "zoomus"
cask "soulver"
cask "parallels"
cask "skype-for-business"
cask "webex-meetings"
cask "sublime-text"
cask "superduper"

# Whole section Matt only
cask "font-fira-code"
cask "font-museo"
cask "font-source-code-pro"
cask "font-ibm-plex"
cask "font-cascadia"
cask "spotify"
cask "karabiner-elements"
cask "mailmate"
cask "iterm2"
cask "handbrake"
cask "hammerspoon"
brew "libdvdcss"
cask "spamsieve"
cask "typinator"
cask "default-folder-x"

# Whole section Terry only
# cask "paparazzi"
